#include<iostream>
using namespace std;

int main21() {

	//C++规定在创建一个变量或者常量时，必须要指定出相应的数据类型，否则无法给变量分配内存

	//作用：整型变量表示的是整数类型的数据

	//C++中能够表示整型的类型有以下几种方式，去背在于所占内存空间不同：

	//1、短整型	(-32768~32767)
	short num1 = -32769;//超出下限会自动回到最上限

	//2、整型 (-2,147,483,648~2,147,483,647)
	int num2 = 2147483648;//超出上限会自动回到最下限

	//3、长整型 (-2,147,483,648~2,147,483,647)
	long num3 = 10;

	//4、长长整型 (-9,223,372,036,854,775,808~9,223,372,036,854,775,807)
	long long num4 = 10;

	cout << "num1 = " << num1 << endl;
	cout << "num2 = " << num2 << endl;
	cout << "num3 = " << num3 << endl;
	cout << "num4 = " << num4 << endl;

	system("pause");

	return 0;
}